In [11]:
import pandas as pd

In [12]:
# Creating dataframe
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)


df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [14]:
df.loc[0:, ['Name']]

                       Name
0   Braund, Mr. Owen Harris
1  Allen, Mr. William Henry
2  Bonnell, Miss. Elizabeth

In [30]:
# Creating Series
numbers = pd.Series([2,4,5,6], name="Numbers")
numbers

0    2
1    4
2    5
3    6
Name: Numbers, dtype: int64

In [16]:
df["Age"].max()

58

In [17]:
df.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

In [ ]:
pd.merge()